var oldTime = new Date().getTime();

var wordSplitSymbol="([^А-Яа-яЁёA-Za-z]|^|$)";
var actionArray=[];
var minimalLiteralLength=20480; //Пока с потолка


function prepareExpression(word, str, prefix, postfix){
	if(word[0] !== str[0])
		return prepareReplaceHeavy(word, str, prefix, postfix);
	var firstLetter=word[0];
	var lostWord=word.substr(1);
	var pattern =
		(prefix ? wordSplitSymbol : "(.|[\s\S]|^)" ) +
		"(["+firstLetter.toLowerCase()+firstLetter.toUpperCase()+"])"+lostWord+
		(postfix ? wordSplitSymbol : "(.|[\s\S]|$)" );
	var regexp=new RegExp(pattern,"gm");
//	console.log(regexp);
	actionArray.push([regexp,"$1$2"+str.substr(1)+"$3"]);
}

var orphoWordsToCorrect=[
	["еще","ещё"],
	["пороль","пароль"],
	["дрож","дрожь"],
	["извени","извини"],
	["жжот","жжёт"],
	["нехочу","не хочу"],
	["молодёж","молодёжь"],
	["полувер","пуловер"],
	["в расплох","врасплох"],
	["продовца","продавца"],
	["всмысле","в смысле"],
	["штол[еь]","что ли"],
	["н[еи]знаю","не знаю"],
	["это-ж","это ж"],
	["падажди","подожди"],
	["во первых","во-первых"],
	["пожалуста","пожалуйста"],
	["безплатно","бесплатно"],
	["досвидание","до свидания"],
	["вс[её]таки","всё-таки"],
	["в кратце","вкратце"],
	["ключь","ключ"],
	["староной","стороной"],
	["немогу","не могу"],
	["в[-]*о+бщем","в общем"],
	["тожэ","тоже"],
	["такжэ","также"],
	["в(?:об|а)ще","вообще"],
	["пожалста","пожалуйста"],
	["скока","сколько"],
	["с[её]дня","сегодня"],
	["патаму","потому"],
	["тада","тогда"],
	["жудко","жутко"],
	["поарать","поорать"],
	["сандали","сандалии"],
	["што","что"],
	["скочать","скачать"],
//	["отзов(?=(?:ы||а|у|ом|ам|ами))","отзыв"],
	["троль","тролль"],
	["придти","прийти"],
	["ложить","класть"],
	["ложу","кладу"],
	["ложим","кладём"],
	["ложишь","кладёшь"],
	["ложите","кладёте"],
	["лож[ау]т","кладут"],
	["лож[ие]т","кладёт"],
	["светой","святой"],//TODO: склонять
	["немогу","не могу"],
	["ноч","ночь"],
	["вкантакте","вконтакте"],
	["чтото","что-то"],
	["скем","с кем"],
	["смореть","смотреть"],
	["ихн(?:ий|его|ему|им|ем|ее|яя|ей|юю|ие|их|им)","их"],
	["на тощак","натощак"],
	["чтоли","что ли"],
	["сдесь","здесь"],
	["незачто","не за что"],
	["калеса","колеса"],
	["какойто","какой-то"],
	["тоесть","то есть"],
	["подругому","по-другому"],
	["знач[её]к","значок"],
	["в кратце","вкратце"],
	["на последок","напоследок"],
	["помо[ей]му","по-моему"],
	["покласть","положить"],
	["никаго","никого"],
	["кагда","когда"],
	["п[ао]ч[ие]му","почему"],
	["наконецто","наконец-то"],
	["гдебы","где бы"],
	["вс[её]время","всё время"],
	["чуть-*ли","чуть ли"],
	["вря[дт]-*ли","вряд ли"],
	["ка[кг]бу[дт]то","как будто"],
	["в догонку","вдогонку"],
	["экспрес*о","эспрессо"],
	["всмысле","в смысле"],
	["ваще","вообще"],
	["потому-что","потому что"],
	["что-бы","чтобы"],
	["што-бы","чтобы"],
	["видете","видите"],//TODO: проспрягать
	["в догонку","вдогонку"],
	["сп[оа]сиб[оа]","спасибо"],
	["типо","типа"],
	["граммот","грамот"],
	["конешно","конечно"],
	["ключ[её]м","ключом"],
	["недай","не дай"],
/*	["",""],
/*
	["",""],
*/
];

var orphoPrefixToCorrect=[
	["шпоргал","шпаргал"],
	["атракцион","аттракцион"],
	["режис[ёе]р","режиссёр"],
	["соеденин","соединен"],
	["симпотич","симпатич"],
	["девч[её]н","девчон"],
	["мущин","мужчин"],
	["большенств","большинств"],
	["седени","сидени"],
	["електр","электр"],
	["приемуществ","преимуществ"],
	["видил","видел"],
	["оффис","офис"],
	["агенств","агентств"],
	["одн[оа]класник","одноклассник"],
	["однаклассник","одноклассник"],
	["видио","видео"],
	["руск","русск"],
	["сматре","смотре"],
	["расчит","рассчит"],
	["кантакт","контакт"],
	["маструб","мастурб"],
	["серебрянн","серебрян"],
	["правельн","правильн"],
	["балон","баллон"],
	["коментар","комментар"],
	["прийд","прид"],
	["раз*сказ","рассказ"],
	["класн","классн"],
	["аргазм","оргазм"],
	["регестрац","регистрац"],
	["куринн","курин"],
	["востанов","восстанов"],
	["дешов","дешёв"],
	["пр[ие]з[ие]ватив","презерватив"],
	["телифон","телефон"],
	["гдето","где-то"],
	["часн","частн"],
	["расспис","распис"],
	["офицал","официал"],
	["здраств","здравств"],
	["тысеч","тысяч"],
	["жост","жест"],
	["примьер","премьер"],
	["сь[её]м","съём"],
	["правел","правил"],
	["еслиб","если б"],
	["свинн","свин"],
	["разсве","рассве"],
	["росписани","расписани"],
	["гостинниц","гостиниц"],
	["комерч","коммерч"],
	["бисплат","бесплат"],
	["бальш","больш"],
	["помаги","помоги"],
	["кароч","короче"],
	["что-бы","чтобы"],
	["безс","бесс"],
	["не долюбли","недолюбли"],
	["боян","баян"],
	["будующ","будущ"],
	["лутш","лучш"],
	["курсав","курсов"],
	["венчестер","винчестер"],
	["брошур","брошюр"],
	["бе[сз]пелот","беспилот"],
	["вмистим","вместим"],
	["жолуд","жёлуд"],
	["возвро","возвра"],
	["в-*течени[ие]","в течение"],
	["вырощен","выращен"],
	["корект","коррект"],
	["грусн","грустн"],
	["граммот","грамот"],
/*
	["",""],
*/
];

var orphoPostfixToCorrect=[
	["борятся","борются"],
	["сыпится","сыпется"],
	["г[ао]в[ао]риш","говоришь"],
	["ються","ются"],
	["аеться","ается"],
	["оеться","оется"],
	["уеться","уется"],
	["яеться","яется"],
	["ееться","еется"],
	["юеться","юется"],
	["-ли"," ли"],
	["-же"," же"],
	["-бы"," бы"],
	["-что"," что"],
	["можеш","можешь"],
	["аеш","аешь"],
	["шся","шься"],
	["гл[аея]диш","глядишь"],
	["сыпатся","сыпаться"],
	["рвуться","рвутся"],
/*	["",""],
/*
	["",""],
*/
];

var orphoFragmentsToCorrect=[
	["будующ","будущ"],
	["празн","праздн"],
	["призидент","президент"],
	["призедент","президент"],
	["цыкл","цикл"],
	["мед[еи]ц[иы]н","медицин"],
	["интерестн","интересн"],
	["класн","классн"],
/*
	["",""],
	["",""],
	["",""],
	["",""],
*/
];

var matyuki=[
];

var yo=[
];

for(var i=0; i<orphoWordsToCorrect.length; i++)
	prepareExpression(orphoWordsToCorrect[i][0],orphoWordsToCorrect[i][1],1,1);
for(var i=0; i<orphoPostfixToCorrect.length; i++)
	prepareExpression(orphoPostfixToCorrect[i][0],orphoPostfixToCorrect[i][1],0,1);
for(var i=0; i<orphoPrefixToCorrect.length; i++)
	prepareExpression(orphoPrefixToCorrect[i][0],orphoPrefixToCorrect[i][1],1,0);
for(var i=0; i<orphoFragmentsToCorrect.length; i++)
	prepareExpression(orphoFragmentsToCorrect[i][0],orphoFragmentsToCorrect[i][1],0,0);



function replaceUniversal(ih){
	return ih.
		replace(/[(]{6,}/g,"(((").
		replace(/[)]{6,}/g,")))").
		replace(/([.?!])\1{3,}/g,"$1$1$1");
}

function prepareReplaceHeavy(reg, str, prefix, postfix){
	var lostreg=reg.substr(1);
	var loststr=str.substr(1);
	var pattern1 =
		(prefix ? wordSplitSymbol : "(.|[\s\S]|^)" ) +
		reg[0].toLowerCase()+lostreg+
		(postfix ? wordSplitSymbol : "(.|[\s\S]|$)" );
	var regexp1=new RegExp(pattern1,"gm");
	var pattern2 =
		(prefix ? wordSplitSymbol : "(.|[\s\S]|^)" ) +
		reg[0].toUpperCase()+lostreg+
		(postfix ? wordSplitSymbol : "(.|[\s\S]|$)" );
	var regexp2=new RegExp(pattern2,"gm");
	actionArray.push([regexp1,"$1"+str[0].toLowerCase()+loststr+"$2"]);
	actionArray.push([regexp2,"$1"+str[0].toUpperCase()+loststr+"$2"]);
}



function mainWork(ih){
	ih=replaceUniversal(ih);
	if(notContainsCyrillic(ih)){
		return ih;
	}
	ih=ih.replace(/([А-Яа-яЁё])\1{3,}/g,"$1$1$1");
	ih=ih.replace(/[ь]{2,}/g,"ь");
	ih=ih.replace(/[ъ]{2,}/g,"ъ");

	ih=ih.replace(/([ЖжШшЩщ])[ыЫ]/g,"$1и");
	ih=ih.replace(/([ЧчЩщ])[яЯ]/g,"$1а");
	ih=ih.replace(/([ЧчЩщ])[юЮ]/g,"$1у");
	ih=ih.replace(/ньч/gi,"нч");
	ih=ih.replace(/ньщ/gi,"нщ");
	ih=ih.replace(/чьн/gi,"чн");
	ih=ih.replace(/чьк/gi,"чк");

	ih=ih.replace(/([^А-Яа-яЁёA-Za-z]|^)з(?=[бжкпстф-щБЖКПСТФ-Щ]|д(?!ани|ань|ес|еш|оров|рав))/g,"$1с");
	ih=ih.replace(/([^А-Яа-яЁёA-Za-z]|^)З(?=[бжкпстф-щБЖКПСТФ-Щ]|д(?!ани|ань|ес|еш|оров|рав))/g,"$1С");

	for(var i=0; i<actionArray.length;i++)
		ih=ih.replace(actionArray[i][0],actionArray[i][1]);
	
	return ih;
}

function notContainsCyrillic(str){
	return str.search(/[А-Яа-яЁё]/) === -1;
}

function changeStrings(n, callback, checkLiteralLength) {
	// Эта рекурсивная функция отыскивает все текстовые узлы

	if (n.nodeType == 3 /* Node.TEXT_NODE */){
		n.data=callback(n.data);
	} else if (n.nodeType == 1 /* Node.ELEMENT_NODE */ || n.nodeType == 9 /* document */) {
		//"Срезаем угол" - если кириллицы нет в большом элементе, то незачем его трогать кириллическими регулярками
/*		if(checkLiteralLength){
			//Пока .innerHTML - слишком медленно
			var ih=n.innerHTML;
			var len=ih.length;
			if(len >= minimalLiteralLength && notContainsCyrillic(ih)){
				checkLiteralLength = 0;
				callback = replaceUniversal;
			} else if (len < minimalLiteralLength){
				checkLiteralLength = 0;
			}
		}
*/		// Обратите внимание, обход выполняется с использованием firstChild/nextSibling
		for (var m = n.firstChild; m != null; m = m.nextSibling) {
			changeStrings(m, callback, checkLiteralLength);
		}
	}
}

changeStrings(document.body, mainWork, true);
console.log("chas-correct отработал. Времени затрачено (мс): "+(new Date().getTime() - oldTime));
