module.exports = [
	', после чего осталось разделить сумму на о|бъём совокупности',
	'Ну, во-первых (вроде не говорил), эти понятия определены только для квадратных матриц',
	'И, во-вторых |(следствие из 1-го)|',
	'Ну а теперь |амбула| (с)',
	'икс стремится к ка',
	'которых интересует «как построить эллибз», «отличие элипса от овала» и «эксцентриситет элебса»',
	'Мене здавня бентежило невідповідність сучасних офіційних наукових теорій багатьом явищам, які зараз працюють, не маючи наукового обґрунтування',
	'Матеріал цього ресурсу допоміг знайти те, чого не діставало, щоб мозаїка склалася.',
];
