module.exports = [
	'Шо (升)',
	'шо (升)',
	'знайти проекцію вектора a=(-3;4) на вектор b=(-1;10) паралельно вектору c=(1;0) помогите пожалюста',
	'Знайдіть координати вершини цього паралелограма',
	'Точки А (4 ; - 2), В (- 2; 6), С (- 6 ; 10) - вершини паралелограма',
	'Як щвидко це можна зробити',
	'Введите значение объёма в шо:',
	'Этот онлайн конвертер позволит вам очень просто преобразовать объём из шо в другие единицы измерения объёма',
	'Для преобразования шо в другие единицы измерения:',
	'Введите заданное значение шо.',
	'1 то = 10 шо (升)',
	'Онлайн калькулятор. Конвертер единиц объёма. Шо',
];
