module.exports = [
	'>Материал из Википедии — свободной энциклопедии<',
	'>Перейти к навигации<',
	'>Перейти к поиску<',
	'title="Викисловарь">Викисловаре</a> есть статья <',
	'>править<',
	'>Для улучшения этой статьи <',
	'>желательно<',
	'>Найти и оформить в виде <',
	'>сносок</a> ссылки на независимые <',
	'>авторитетные источники<',
	'>подтверждающие написанное<',
	'>Дополнить статью (статья <',
	'>слишком короткая</a> либо содержит лишь <',
	'>словарное определение<',
	/>\s*Источник — </g,
	'>Категория</a>: <',
	'>См. также<',


	'Свиннертон',
	'Полное название этого учебника — «Сия книга, глаголемая по еллински и по гречески арифметика, а по немецки алгоризма, а по русски цифирная счётная мудрость»',

];
