/*
Copyright Nikolay Avdeev aka NickKolok aka Николай Авдеев 2015

Всем привет из снежного Воронежа! 

This file is part of CHAS-CORRECT.

    CHAS-CORRECT is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    CHAS-CORRECT is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with CHAS-CORRECT.  If not, see <http://www.gnu.org/licenses/>.

  (Этот файл — часть CHAS-CORRECT.

   CHAS-CORRECT - свободная программа: вы можете перераспространять её и/или
   изменять её на условиях Стандартной общественной лицензии GNU в том виде,
   в каком она была опубликована Фондом свободного программного обеспечения;
   либо версии 3 лицензии, либо (по вашему выбору) любой более поздней
   версии.

   CHAS-CORRECT распространяется в надежде, что она будет полезной,
   но БЕЗО ВСЯКИХ ГАРАНТИЙ; даже без неявной гарантии ТОВАРНОГО ВИДА
   или ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ. Подробнее см. в Стандартной
   общественной лицензии GNU.

   Вы должны были получить копию Стандартной общественной лицензии GNU
   вместе с этой программой. Если это не так, см.
   <http://www.gnu.org/licenses/>.)
*/
'use strict';

var precacheVKsoviet={
	' — отправка телеграммы':null,
	' — перенос строки':null,
	' Скачать':null,
	' Скачать альбом':null,
	'Введите имя, название или слово':null,
	'Высказаться':null,
	'Донести на врага народа':null,
	'Достать старые телеграммы ↑':null,
	'Здесь Вы будете видеть новостную ленту своих товарищей.':null,
	'Здесь будет выводиться история переписки.':null,
	'На связи':null,
	'На этой фотокарточке: undefined':null,
	'Направление':null,
	'Одобряю':null,
	'Пожаловаться':null,
	'Показаны последние новости':null,
	'Показать больше фотокарточек':null,
	'Показать предыдущие новости ↓':null,
	'Показать следующие сообщения ↓':null,
	'Понимаю, но осуждаю':null,
	'Пригласить на видеозвонок':null,
	'Просмотреть подробное досье':null,
	'Разгласить':null,
	'бдит':null,
	'был замечен на следующих фотокарточках:':null,
	'была замечена на следующих фотокарточках:':null,
	'одну минуту назад':null,
	'опубликовал фотографию':null,
	'опубликовала фотографию':null,
	'от имени оргсовета':null,
	'показать целиком..':null,
	'просмотреть предыдущие высказывания':null,

/*
	'':null,
	'':null,
	'':null,
	'':null,
*/
	//Отдельный блок - частоменяющиеся минуты
	'одну минуту назад':null,
	'две минуты назад':null,
	'три минуты назад':null,
	'четыре минуты назад':null,
	'пять минут назад':null,
	'6 минут назад':null,
	'7 минут назад':null,
	'8 минут назад':null,
	'9 минут назад':null,
	'10 минут назад':null,
	'11 минут назад':null,
	'12 минут назад':null,
	'13 минут назад':null,
	'14 минут назад':null,
	'15 минут назад':null,
	'16 минут назад':null,
	'17 минут назад':null,
	'18 минут назад':null,
	'19 минут назад':null,
	'20 минут назад':null,
	'21 минуту назад':null,
	'22 минуты назад':null,
	'23 минуты назад':null,
	'24 минуты назад':null,
	'25 минут назад':null,
	'26 минут назад':null,
	'27 минут назад':null,
	'28 минут назад':null,
	'29 минут назад':null,
	'30 минут назад':null,
	'31 минуту назад':null,
	'32 минуты назад':null,
	'33 минуты назад':null,
	'34 минуты назад':null,
	'35 минут назад':null,
	'36 минут назад':null,
	'37 минут назад':null,
	'38 минут назад':null,
	'39 минут назад':null,
	'40 минут назад':null,
	'41 минуту назад':null,
	'42 минуты назад':null,
	'43 минуты назад':null,
	'44 минуты назад':null,
	'45 минут назад':null,
	'46 минут назад':null,
	'47 минут назад':null,
	'48 минут назад':null,
	'49 минут назад':null,
	'50 минут назад':null,
	'51 минуту назад':null,
	'52 минуты назад':null,
	'53 минуты назад':null,
	'54 минуты назад':null,
	'55 минут назад':null,
	'56 минут назад':null,
	'57 минут назад':null,
	'58 минут назад':null,
	'59 минут назад':null,

	'час назад':null,
	'сегодня':null,
};
